13/data/attachments/9f6610377f693d3f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b0e9a363-8ee3-4b94-a37a-9758285a8b80</nif:username>
            <nif:friendToBeAdded>Richard_best_Friend_73129_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>